Repository: pypi-data/pypi-mirror-85
Catalog: packages/contenttypes.basic/contenttypes.basic-1.6.4.tar.gz/contenttypes.basic-1.6.4/src/contenttypes/basic/locales/*/LC_MESSAGES/contenttypes.basic.po
Languages: ca

source: Add icon
ca: Afegir icona

source: Adds OpenStreet map field
ca: Afegeix el camp de mapa OpenStreet

source: Adds button text field
ca: Afegeix el camp text del botó

source: Adds colour field
ca: Afegeix el camp de color

source: Adds hide text field
ca: Afegeix el camp ocultar text

source: Adds icon field
ca: Afegeix el camp icona

source: Adds link field
ca: Afegeix el camp enllaç

source: Adds text position field
ca: Afegeix el camp posició del text

source: Announcement
ca: Avís

source: Bottom - Centre
ca: Inferior - Centre

source: Bottom - Left
ca: Inferior - Esquerra

source: Bottom - Right
ca: Inferior - Dreta

source: Button Text Behavior
ca: Comportament Text del botó

source: Button text
ca: Text del botó

source: Centre - Left
ca: Centre - Esquerra

source: Centre - Right
ca: Centre - Dreta

source: Change icon
ca: Canviar icona

source: Clear coordinates
ca: Netejar coordenades

source: Colour
ca: Color

source: Colour Behavior
ca: Comportament Color

source: Colour Widget
ca: Widget Color

source: Coordinates
ca: Coordenades

source: Enter an address or set the location mark on the map
ca: Entreu una adreça o moveu el marcador al mapa

source: Geolocation
ca: Geolocalització

source: Hide Text
ca: Ocultar text

source: Hide Text Behavior
ca: Comportament Ocultar text

source: Icon
ca: Icona

source: Icon Behavior
ca: Comportament Icona

source: Icon Widget
ca: Widget Icona

source: Link
ca: Enllaç

source: Link Behavior
ca: Comportament Enllaç

source: Map center
ca: Centre del mapa

source: More information
ca: Més informació

source: OSMap Behavior
ca: Comportament OSMap

source: OSMap Widget
ca: Widget OSMap

source: Position
ca: Posició

source: Position where the title and the button will be displayed over the image. Only useful for medium and up screens.
ca: Posició on el títol i el botó es mostran sobre la imatge. Només útil per pantalles mitjanes i superiors.

source: Search
ca: Cercar

source: Select an icon
ca: Seleccioneu una icona

source: Set the default coordinates for the map widget.
ca: Indiqueu les coordenades per defecte del widget del mapa.

source: Text Position Behavior
ca: Comportament Text posició

source: Type an address
ca: Escriviu una adreça

source: Upper - Centre
ca: Superior - Centre

source: Upper - Left
ca: Superior - Esquerra

source: Upper - Right
ca: Superior - Dreta

source: View Announcement
ca: Vista Avís

source: View Banner
ca: Vista Banner

source: View Icon
ca: Vista Icona

source: View Link
ca: Vista Enllaç

source: View Slide
ca: Vista Slide
