Repository: pypi-data/pypi-mirror-85
Catalog: packages/contenttypes.basic/contenttypes.basic-1.6.4-py3-none-any.whl/contenttypes/basic/locales/*/LC_MESSAGES/contenttypes.basic.po
Languages: es

source: Add icon
es: Añadir icono

source: Adds OpenStreet map field
es: Añade el campo de mapa OpenStreet

source: Adds button text field
es: Añade el campo texto del botón

source: Adds colour field
es: Añade el campo de color

source: Adds hide text field
es: Añade el campo ocultar texto

source: Adds icon field
es: Añade el campo icono

source: Adds link field
es: Añade el campo enlace

source: Adds text position field
es: Añade el campo posición del texto

source: Announcement
es: Aviso

source: Bottom - Centre
es: Inferior - Centro

source: Bottom - Left
es: Inferior - Izquierda

source: Bottom - Right
es: Inferior - Derecha

source: Button Text Behavior
es: Comportamiento Texto del botón

source: Button text
es: Texto del botón

source: Centre - Centre
es: Centro - Centro

source: Centre - Left
es: Centro - Izquierda

source: Centre - Right
es: Centro - Derecha

source: Change icon
es: Cambiar icono

source: Clear coordinates
es: Limpiar coordenades

source: Colour
es: Color

source: Colour Behavior
es: Comportamiento Color

source: Colour Widget
es: Widget Color

source: Coordinates
es: Coordenadas

source: Enter an address or set the location mark on the map
es: Entre una dirección o mueva el marcador en el mapa

source: Geolocation
es: Geolocalización

source: Hide Text
es: Ocultar texto

source: Hide Text Behavior
es: Comportamiento Ocultar texto

source: Icon
es: Icono

source: Icon Behavior
es: Comportamiento Icono

source: Icon Widget
es: Widget Icono

source: Link
es: Enlace

source: Link Behavior
es: Comportamiento Enlace

source: Map center
es: Centro del mapa

source: More information
es: Más información

source: OSMap Behavior
es: Comportamiento OSMap

source: OSMap Widget
es: Widget OSMap

source: Position
es: Posición

source: Position where the title and the button will be displayed over the image. Only useful for medium and up screens.
es: Posición donde el título y el botón se mostran sobre la imagen. Solo útil para pantallas medianas y superiores.

source: Search
es: Buscar

source: Select an icon
es: Seleccione un icono

source: Set the default coordinates for the map widget.
es: Indica la coordenadas por defecto del widget del mapa.

source: Text Position Behavior
es: Comportamiento Texto posición

source: Type an address
es: Escribe una dirección

source: Upper - Centre
es: Superior - Centro

source: Upper - Left
es: Superior - Izquierda

source: Upper - Right
es: Superior - Derecha

source: View Announcement
es: Vista Aviso

source: View Banner
es: Vista Banner

source: View Icon
es: Vista Icono

source: View Link
es: Vista Enlace

source: View Slide
es: Vista Slide
