Repository: pypi-data/pypi-mirror-85
Catalog: packages/Products.MeetingLiege/Products.MeetingLiege-4.1.1.tar.gz/Products.MeetingLiege-4.1.1/src/Products/MeetingLiege/locales/*/LC_MESSAGES/imio.history.po
Languages: fr

source: accept_and_return_comments
fr: Le point a été envoyé au Conseil Communal puis automatiquement dupliqué et le nouveau point est disponible pour une prochaine séance.

source: create_to_meeting-config-college_from_meeting-config-council_comments
fr: Point créé depuis un point Conseil.

# create_to_meeting-config-council_from_meeting-config-college_comments
source: Item created from a college item.
fr: Point créé depuis un point Collège.

source: financial_advice_signed_historized_comments
fr: L'avis a été automatiquement historisé lorsqu'il a été 'Signé'.

source: historize_main_infos_comments
fr: Les informations principales du point ont été historisées lors de la transition 'Proposer au Gestionnaire Cabinet'.<br /><div class='historyLinks'><a href='${url}/@@main_infos_history_view?event_time:int=${event_time}' class='link-overlay-pm-over'>Voir</a></div>

source: item_wf_changed_every_advices_given
fr: Le point a automatiquement changé d'état car tous les avis demandés ont été rendus.

# item_wf_changed_finance_advice_negative
source: The item has been automatically sent back to the director because the relevant finance advice was negative.
fr: Le point a été automatiquement renvoyé au directeur car l'avis du service finance rendu était défavorable.

# item_wf_changed_finance_advice_positive
source: The item has been automatically validated because the relevant finance advice was positive.
fr: Le point a été automatiquement proposé à la séance car l'avis du service finance rendu était favorable.

# item_wf_changed_finance_advice_timed_out
source: The item has been automatically validated because the finance advice was timed out.
fr: Le point a été automatiquement proposé à la séance car le délai pour rendre l'avis du service finance est dépassé.

# return_comments
source: The item has been duplicated and the new item is available for a next meeting.
fr: Le point a été automatiquement dupliqué et le nouveau point est disponible pour une prochaine séance.
