Repository: pypi-data/pypi-mirror-85
Catalog: packages/Products.MeetingLiege/Products.MeetingLiege-4.1.1.tar.gz/Products.MeetingLiege-4.1.1/src/Products/MeetingLiege/locales/*/LC_MESSAGES/PloneMeeting.po
Languages: fr

source: Access the College item containing given finance advice.
fr: Accéder au point Collège contenant l'avis rendu par le Directeur Financier.

source: Data that will be used once item will be in the council
fr: Données utilisées pour le point Conseil

source: Historized data
fr: Informations historisées

# Meeting config College
source: College
fr: Collège communal

# Meeting config Council
source: Council
fr: Conseil communal

source: MeetingAdviceFinances
fr: Avis finances

# MeetingLiege_descr_financeAdvice
source: If necessary, select the financial service that will have to give the legal financial advice on this item.
fr: Sélectionnez ici le service DF qui devra émettre un avis de légalité sur le point.

# MeetingLiege_descr_textCheckList
source: Enter elements that are necessary for this kind of item to be considered as 'complete'.
fr: Encodez la liste des éléments nécessaires pour que ce type de point soit considéré 'complet'.

# MeetingLiege_label_adoptsNextCouncilAgenda
source: This meeting adopts next council agenda
fr: Cette séance arrête l'ordre du jour du prochain Conseil communal?

# MeetingLiege_label_advice_substep_number
source: Sub-step number
fr: Numéro de sous-étape

# MeetingLiege_label_archivingRef
source: Archiving reference
fr: Code archivage

# MeetingLiege_label_archivingRefs
source: Archiving references
fr: Codes archivage

# MeetingLiege_label_decisionEnd
source: Decision (end)
fr: Fin du dispositif

# MeetingLiege_label_financeAdvice
source: Financial advice
fr: Avis du Directeur Financier

# MeetingLiege_label_labelForCouncil
source: Label to use for item in Council
fr: Libellé dans le Conseil

# PloneMeeting_label_decision
source: Decision
fr: Dispositif (essence de la décision)

# PloneMeeting_label_detailedDescription
source: Precise
fr: Précis

# PloneMeeting_label_itemDescription
source: Purpose
fr: Objet

source: PloneMeeting_label_itemIsSigned
fr: Point visé?

# PloneMeeting_label_itemTitle
source: Summary of the purpose
fr: Résumé de l'objet

# PloneMeeting_label_toDiscuss
source: To discuss ?
fr: Point avec acte?

# PloneMeeting_label_toDiscussDefault
source: Default value of the 'toDiscuss' attribute for normal items
fr: Valeur par défaut de l'attribut 'Point avec acte' pour les points normaux

# PloneMeeting_label_toDiscussLateDefault
source: Default value of the 'toDiscuss' attribute for late items
fr: Valeur par défaut de l'attribut 'Point avec acte' pour les points en retard

# PloneMeeting_label_toDiscussSetOnItemInsert
source: Set 'toDiscuss' field values when items are inserted into a meeting
fr: Affecter une valeur au champ 'Point avec acte' quand un point est inséré dans une séance

# PloneMeeting_label_toDiscussShownForLateItems
source: Show field 'to discuss' on lists of late items
fr: Montrer le champ 'Point avec acte' sur les listes de points en retard

source: See/hide data used for council item
fr: Montrer/cacher données utilisées pour le point Conseil

source: The item that was sent to Council has been deleted.
fr: Le point qui avait déjà été envoyé au Conseil a été supprimé.

source: add_new_meetingadvicefinances
fr: Ajouter un avis finances

source: Administrative reviewers
fr: Validateurs administratifs

# advice_required_to_ask_advices
source: No advice to ask
fr: Aucun avis à demander (ou les avis sélectionnés ne peuvent pas être demandés maintenant)

# and_description
source: , complete purpose
fr: , objet complet

# archivingRef_required
source: Please select an archiving reference.
fr: Veuillez sélectionner un code archivage.

# archiving_refs_descr
source: Enter archiving references that will be useable on items of this meeting config.
fr: Encodez les codes archivages qui pourront être utilisés par les points de cette configuration de séance.

# completeness_asked_again_by_app
source: The completeness has been asked again by the application when the item has been proposed to the finances.
fr: La complétude a été remise automatiquement par l'application en 'Evaluation demandée à nouveau' lorsque le point a été proposé aux finances.

# finance_advice_not_giveable_because_item_not_complete
source: This advice can not be given because the item is still not considered complete by the finance group.
fr: <span class='discreet' style='color: red;'>Cet avis ne pourra être rendu que lorsque le point sera considéré 'complet'.</span>

# finance_advice_suspended_because_item_sent_back_to_proposing_group
source: This advice is suspended because the item has been sent back to the proposing group.
fr: <span class='discreet' style='color: red;'>Cet avis est suspendu car le point a été renvoyé vers le groupe proposant.</span>

source: Financial controllers
fr: Contrôleurs financiers

source: Financial managers
fr: Directeurs financiers

source: Financial reviewers
fr: Validateurs financiers

source: Front page body
fr: <p>Avant de tester, nous vous recommandons de lire la <span class="link-external"><a target='_blank' href='http://www.imio.be/support/documentation/manual/plonemeeting32'>documentation</a></span> qui explique en détails le fonctionnement du logiciel. Ce manuel évolue constamment.<br> <br>La gestion de cette application repose sur différents profils auxquels sont liés des droits (un même utilisateur peut avoir plusieurs profils), <i>le mot de passe pour vous connecter avec les différents profils vous a été envoyé par e-mail</i>:</p><p><strong>1) Le profil "agent communal"</strong> qui permet de créer des points à proposer à la séance</p> <p>Pour vous connecter en tant qu'agent du service du "Personnel", utilisez le login de test créé à cet effet (login=<strong>agentPers</strong>).&nbsp;</p> <p class='discreet'>Une fois connecté, vous pouvez cliquer sur l'onglet désiré et gérer vos points.<br>N'oubliez pas de vous déconnecter avant de tester un autre profil.</p><p><strong>2) Le profil "chef de service"</strong> qui permet de valider un point proposé par un agent de son service</p> <p>Pour vous vous connecter en tant que chef du service "Personnel", utilisez le login de test créé à cet effet (login=<strong>chefPers</strong>).&nbsp;</p> <p class='discreet'>Une fois connecté, vous pouvez cliquer sur l'onglet désiré et gérer vos points et ceux du service.<br>N'oubliez pas de vous déconnecter avant de tester un autre profil.</p><p><strong>3) Le profil "émetteur d'avis"</strong> qui permet de donner un avis sur un point (si cet avis a été demandé)</p> <p>Pour vous connecter en tant qu'émetteur d'avis pour le service "Comptabilité", utilisez le login de test créé à cet effet (login=<strong>chefCompta</strong>).</p> <p class='discreet'>Une fois connecté, vous pouvez cliquer sur l'onglet désiré et visualiser les points pour lesquels un avis est nécessaire.<br>N'oubliez pas de vous déconnecter avant de tester un autre profil.</p><p><strong>4) Le profil "Directeur Général"</strong> qui permet de créer un ordre du jour, d'y ajouter des points proposés et de compléter le PV des séances<br> Pour vous connecter en tant que "Directeur Général", utilisez le login de test créé à cet effet (login=<strong>dgen</strong>).</p> <p class='discreet'>Une fois connecté, vous pouvez cliquer sur l'onglet désiré et visualiser les points, les séances, les PV, ...<br>N'oubliez pas de vous déconnecter avant de tester un autre profil.</p><p><strong>5) Le profil "échevin" ou lecteur</strong> qui permet de consulter les points sans pouvoir les modifier</p> <p>Pour vous connecter en tant que personne pouvant consulter des points pour le service "Personnel", utilisez le login de test créé à cet effet (login=<strong>echevinPers</strong>).</p> <p class='discreet'>Une fois connecté, vous pouvez visualiser les points du service et les points inclus à l'odre du jour.<br>N'oubliez pas de vous déconnecter avant de tester un autre profil.</p><p><strong>6) Un profil "observateur de toutes les séances"</strong> qui permet d'avoir un accès en lecture à tous à partir du moment où l'élément est passé par l'étape "gelé"</p> <p>Pour vous connecter en tant que personne pouvant consulter tout, utilisez le login de test créé à cet effet (login=<strong>bourgmestre</strong>).</p><p class='discreet'>Une fois connecté, vous pouvez cliquer sur n'importe quel onglet et accéder à l'ensemble des points.<br>N'oubliez pas de vous déconnecter avant de tester un autre profil.</p><p><strong>7) Un profil "observateur pour le conseil"</strong> qui permet d'avoir un accès en lecture à tout le conseil à partir du moment où l'élément est passé par l'étape "gelé"</p> <p>Pour vous connecter en tant que personne pouvant consulter tout le conseil, utilisez le login de test créé à cet effet (login=<strong>conseiller</strong>).</p><p class='discreet'>Une fois connecté, vous pouvez accéder à un type de séance et visualiser l'ensemble des points.<br>N'oubliez pas de vous déconnecter avant de tester un autre profil.</p><p><strong>6) Un profil "Directeur Financier"</strong> qui est un profil cumulant plusieurs rôles : accès à tous les points en lecture, possibilité de modifier les informations budgétaires des points dans certains états, possibilité de rendre un avis sur un point même si l'avis n'a pas été demandé, ...</p> <p>Pour vous connecter en tant que "Directeur Financier", utilisez le login de test créé à cet effet (login=<strong>dfin</strong>).</p><p class='discreet'>Une fois connecté, vous pouvez cliquer sur l'onglet désiré et tester sur les différents points existants dans différents états.<br>N'oubliez pas de vous déconnecter avant de tester un autre profil.</p>

# icon_help_accepted_and_returned
source: Accepted and returned
fr: Accepté avec retour Collège

# icon_help_accepted_but_modified
source: Accepted with modifications
fr: Accepté avec modifications

source: icon_help_adopts_next_council_agenda
fr: Arrête l'ordre du jour du prochain Conseil communal

# icon_help_pre_accepted
source: Pre accepted
fr: Accepté sous réserve

# icon_help_proposed_to_administrative_reviewer
source: Proposed to administrative reviewer
fr: Proposé au validateur administratif

source: icon_help_proposed_to_cabinet_manager
fr: Proposer au Gestionnaire Cabinet

source: icon_help_proposed_to_cabinet_reviewer
fr: Proposé au Validateur Cabinet

source: icon_help_proposed_to_director
fr: Proposé à la direction

source: icon_help_proposed_to_director_waiting_advices
fr: Avis demandés par la direction

# icon_help_proposed_to_finance
source: Proposed to finance
fr: Proposé aux finances

source: icon_help_proposed_to_general_manager
fr: Proposé au Directeur Général

# icon_help_proposed_to_internal_reviewer
source: Proposed to internal reviewer
fr: Proposé au validateur interne

# icon_help_proposed_to_internal_reviewer_waiting_advices
source: Advices asked by internal reviewer
fr: Avis demandés par le validateur interne

# icon_help_returned
source: Returned
fr: Retour Collège

# icon_help_sent_to_council_emergency
source: Sent to Council emergency
fr: Envoyé au Conseil Communal en urgence

source: icon_help_waiting_advices_from_itemcreated
fr: Avis demandés par le créateur

# icon_help_wf_down_finances
source: This item is down the workflow from finances
fr: Ce point redescend le workflow depuis les finances

source: incopy
fr: En copie

# inserting_methods_not_using_to_discuss_error
source: You can not select 'Follow to discuss order' inserting method as the field 'To discuss ?' is not selected in the field 'Attributes used for characterizing an item' of this meeting configuration.
fr: Vous ne pouvez pas sélectionner 'Par point avec acte (avec acte et ensuite sans acte)' car 'Point avec acte?' n'est pas sélectionné dans le champ 'Attributs utilisés pour caractériser un point' de cette configuration de séance.

source: Internal reviewers
fr: Validateurs internes

source: item_is_signed_no
fr: Le point est visé.

source: item_is_signed_no_edit
fr: Le point n'est pas visé. Cliquez pour apposer le visa.

source: item_is_signed_yes
fr: Le point est visé.

source: item_is_signed_yes_edit
fr: Le point est visé. Cliquez pour enlever le visa.

# listingheader_item_title
source: Summary of the purpose
fr: Résumé de l'objet

# negative_finance
source: Unfavorable opinion
fr: Avis finances défavorable

source: Nil
fr: Pas concerné

source: No financial impact
fr: Sans incidence financière

# not_required_finance
source: Not required opinion
fr: Avis finances non requis

# on_decision_first_word
source: Follow first word of decision field order
fr: Par ordre alphabétique du premier mot du champ 'Dispositif (essence de la décision)'

# on_to_discuss
source: Follow to discuss (to discuss then not to discuss)
fr: Par point à discuter (à discuter et ensuite pas à discuter)

# positive_finance
source: Favorable opinion
fr: Avis finances favorable

# positive_with_remarks_finance
source: Favorable opinion with remarks
fr: Avis finances favorable avec remarques

# predecessor_MeetingItemCollege
source: Item College
fr: Collège

# predecessor_MeetingItemCouncil
source: Item Council
fr: Conseil

source: Reviewers
fr: Direction

# searchadviceproposedtocontroller
source: Advices proposed to financial controller
fr: Avis proposés aux contrôleurs financiers

# searchadviceproposedtomanager
source: Advices proposed to financial manager
fr: Avis proposés au directeur financier

# searchadviceproposedtoreviewer
source: Advices proposed to financial reviewer
fr: Avis proposés aux validateurs financiers

# searchitemstocontrolcompletenessof
source: Items to control completeness of
fr: complétude à contrôler

# searchitemswithfinanceadvice
source: Synthesis finance advices
fr: Synthèse avis DF

# sendto_meeting-config-college_success
source: The item has been successfully transfered to the college.
fr: Le point a été envoyé au Collège communal.

# sendto_meeting-config-council_success
source: The item has been successfully transfered to the council.
fr: Le point a été envoyé au Conseil communal.

# to_discuss_ask_mail_not_sent
source: Sending emails to meeting managers has been disabled. Please contact them through other means for asking them to discuss this item.
fr: L'envoi de courriels aux gestionnaires de séances est désactivé. Veuillez prendre contact avec eux par un autre canal afin d'exprimer votre désir d'avoir un acte pour ce point.

# to_discuss_ask_mail_sent
source: A mail was sent to the meeting managers for asking them to discuss this item.
fr: Un mail a été envoyé aux gestionnaires de séance pour exprimer votre désir d'avoir un acte pour ce point.

# to_discuss_default_descr
source: The optional item attribute 'to discuss' allows the meeting manager to specify if an item presented to a meeting should be discussed during this meeting or if, simply, it must appear in the agenda and the meeting decisions for traceability purposes but has already led to a decision before the meeting occurrence. Check the box if you want the items to be set to 'discussed' by default.
fr: L'attribut optionnel 'point avec acte' permet au gestionnaire de séance de spécifier si un point présenté à une séance aura un acte. Cochez la case si vous voulez que les points soient, par défaut, avec acte.

# to_discuss_late_default_descr
source: Check the box if you want the 'late' items to be set to 'discussed' by default.
fr: Cochez la case si vous voulez que les points qui sont présentés 'en retard' soient, par défaut, avec acte.

source: to_discuss_no
fr: Point sans acte

# to_discuss_no_ask_edit
source: Click on the image for asking to discuss this item.
fr: Cliquez sur l'image pour demander de passer en point avec acte.

# to_discuss_no_edit
source: Not to be discussed during the meeting. Click on the image for discussing the item.
fr: Point sans acte, cliquez sur l'image pour passer en 'Point avec acte'.

# to_discuss_set_on_item_insert_descr
source: If you check this box, the value of field 'toDiscuss', for an item, will be set when inserting the item into a meeting, with a default value as defined by the fields below. Else, the user having the permission to edit the item will be able to give a value to this field, as soon as on item creation.
fr: Si vous cochez cette case, la valeur du champ 'point avec acte', pour un point, sera déterminée lors de l'insertion du point dans une séance, selon une valeur par défaut telle que déterminée par les champs ci-dessous. Sinon, l'utilisateur ayant les droits d'édition sur un point pourra éditer cette valeur lui-même, dès la création du point.

# to_discuss_shown_for_late_items_descr
source: Check the box if you want to show column 'to discuss' on lists of late items (checked is the default). For late items, users may not be allowed to choose the value for this field (ie, late items are to be discussed anyway).
fr: Cochez la case si vous voulez afficher la colonne 'Point avec acte' sur les listes de points en retard (coché par défaut). Pour les points en retard, les utilisateurs pourraient ne pas être en droit de choisir la valeur pour ce champ (par exemple, les points en retard pourraient être 'avec acte' d'office).

source: to_discuss_yes
fr: Point avec acte

# to_discuss_yes_edit
source: To be discussed during the meeting. Click on the image for not discussing the item.
fr: Point avec acte, cliquez sur l'image pour passer en 'Point sans acte'.

# wa_items_come_validated
source: Items come validated
fr: Les points arrivent proposés à la séance
