Repository: pypi-data/pypi-mirror-85
Catalog: packages/Products.MeetingLiege/Products.MeetingLiege-4.1.1.tar.gz/Products.MeetingLiege-4.1.1/src/Products/MeetingLiege/locales/*/LC_MESSAGES/plone.po
Languages: fr

source: MeetingBourgmestre
fr: Séance Bourgmestre

source: Meeting College
fr: Séance du Collège communal

source: Meeting Council
fr: Séance du Conseil communal

source: MeetingItemBourgmestre
fr: Point Bourgmestre

# MeetingItemCollege
source: Item College
fr: Point Collège communal

# MeetingItemCouncil
source: Item Council
fr: Point Conseil communal

source: MeetingItemRecurringBourgmestre
fr: Point récurrent Bourgmestre

source: MeetingItemRecurringCollege
fr: Point récurrent Collège communal

source: MeetingItemRecurringCouncil
fr: Point récurrent Conseil communal

source: MeetingItemTemplateBourgmestre
fr: Modèle de point Bourgmestre

source: MeetingItemTemplateCollege
fr: Modèle de point Collège communal

source: MeetingItemTemplateCouncil
fr: Modèle de point Conseil communal

source: Accept and return
fr: Accepter avec retour Collège

# accept_but_modify
source: Accept with modifications
fr: Accepter avec modifications

source: Accepted and returned
fr: Accepté avec retour Collège

# accepted_but_modified
source: Accepted with modifications
fr: Accepté avec modifications

source: askAdvicesByDirector
fr: Demander les avis (Direction)

# askAdvicesByInternalReviewer
source: Ask advices
fr: Demander les avis (VI)

# askAdvicesByItemCreator
source: Ask advices
fr: Demander les avis (Créateur)

source: Back to created
fr: Remettre en création

source: Back to decided
fr: Remettre en rédaction du PV

source: Back to decisions published
fr: Remettre en 'Décisions publiées'

source: Back to frozen
fr: Remettre en 'Gelé'

source: Back to item created
fr: Remettre 'En création'

source: Back to proposed to administrative reviewer
fr: Renvoyer au validateur administratif

source: backToProposedToCabinetManager
fr: Renvoyer au Gestionnaire Cabinet

source: backToProposedToCabinetReviewer
fr: Renvoyer au Validateur Cabinet

source: Back to proposed to director
fr: Renvoyer au directeur

source: Back to proposed to financial controller
fr: Renvoyer au contrôleur financier

source: Back to proposed to financial manager
fr: Renvoyer au directeur financier

source: Back to proposed to financial reviewer
fr: Renvoyer au validateur financier

source: backToProposedToGeneralManager
fr: Renvoyer au Directeur Général

source: Back to proposed to internal reviewer
fr: Renvoyer au validateur interne

source: backToValidatedFromSentToCouncilEmergency
fr: Remettre en 'Proposé à la séance'

source: bourgmestre_validate
fr: Proposer au Bourgmestre

source: bourgmestre_validated
fr: Proposé au Bourgmestre

source: create_to_meeting-config-college_from_meeting-config-council
fr: Envoyer vers Collège Communal

# create_to_meeting-config-council_from_meeting-config-college
source: Create an item council from an item college
fr: Envoyer vers Conseil Communal

source: Delay
fr: Ajourner

source: Delayed
fr: Ajourné

source: Financial advice signed
fr: Avis finance signé

source: historize_main_infos
fr: Historiser les infos principales

# historize_signed_advice_content
source: Historize signed advice
fr: Historiser avis DF signé

# itemcreated_waiting_advices
source: Advices asked by creator
fr: Avis demandé par le créateur

source: Mark not applicable
fr: Sans objet

source: Marked not applicable
fr: Sans objet

source: Pre accept
fr: Accepter sous réserve

source: Pre accepted
fr: Accepté sous réserve

source: Propose to administrative reviewer
fr: Proposer au validateur administratif

source: proposeToCabinetManager
fr: Proposer au Gestionnaire Cabinet

source: proposeToCabinetReviewer
fr: Proposer au Validateur Cabinet

source: Propose to director
fr: Proposer à la direction

source: Propose to finance
fr: Proposer aux finances

source: Propose to financial controller
fr: Proposer au contrôleur financier

source: Propose to financial manager
fr: Proposer au directeur financier

source: Propose to financial reviewer
fr: Proposer au validateur financier

source: proposeToGeneralManager
fr: Proposer au Directeur Général

source: Propose to internal reviewer
fr: Proposer au validateur interne

source: Proposed to administrative reviewer
fr: Proposé au validateur administratif

source: proposed_to_cabinet_manager
fr: Proposé au Gestionnaire Cabinet

source: proposed_to_cabinet_reviewer
fr: Proposé au Validateur Cabinet

source: Proposed to director
fr: Proposé à la direction

source: proposed_to_director_waiting_advices
fr: Avis demandés par la direction

source: Proposed to finance
fr: Proposé aux finances

source: Proposed to financial controller
fr: Proposé au contrôleur financier

source: Proposed to financial manager
fr: Proposé au directeur financier

source: Proposed to financial reviewer
fr: Proposé au validateur financier

source: proposed_to_general_manager
fr: Proposé au Directeur Général

source: Proposed to internal reviewer
fr: Proposé au validateur interne

# proposed_to_internal_reviewer_waiting_advices
source: Advices asked by internal reviewer
fr: Avis demandés par le validateur interne

source: Return
fr: Ajourner avec retour Collège

source: Returned
fr: Ajourné avec retour Collège

source: sendToCouncilEmergency
fr: Envoyer au Conseil Communal en urgence

source: sent_to_council_emergency
fr: Envoyé au Conseil Communal en urgence

source: Sign financial advice
fr: Signer l'avis financier

source: Validate
fr: Proposer à la séance

source: Validated
fr: Proposé à la séance
