Repository: pypi-data/pypi-mirror-85
Catalog: packages/collective.contact.importexport/collective.contact.importexport-0.3.9.tar.gz/collective.contact.importexport-0.3.9/src/collective/contact/importexport/locales/*/LC_MESSAGES/collective.contact.importexport.po
Languages: fr

source: Import contacts
fr: Import des contacts

source: Import csv organizations file
fr: Importer un fichier csv contenant des organisations

source: Import csv persons file
fr: Importer un fichier csv contenant des personnes

source: Installs the collective.contact.importexport add-on.
fr: Installer le package collective.contact.importexport.

source: Organizations file
fr: Fichier des organisations

source: Persons file
fr: Fichier des personnes

source: Please select state for objects created.
fr: Veuillez sélectionner l'état des objets qui seront crées

source: State after creation
fr: Etat après la création

source: Uninstalls the collective.contact.importexport add-on.
fr: Désinstaller le package collective.contact.importexport.

source: collective.contact.importexport (uninstall)
fr: collective.contact.importexport (désinstallation)
