Repository: pypi-data/pypi-mirror-85
Catalog: packages/fiduswriter-citation-api-import/fiduswriter-citation-api-import-3.9.0.tar.gz/fiduswriter-citation-api-import-3.9.0/fiduswriter/citation_api_import/locale/*/LC_MESSAGES/djangojs.po
Languages: bg

source: Search bibliography databases
bg: Търсене в библиографски бази данни

source: Looking...
bg: Търся ...

source: Title, Author, DOI, etc.
bg: Заглавие, автор, DOI и т.н.

source: search
bg: Търсене

source: Title
bg: Заглавие

source: Author(s)
bg: Автор(и)

source: Published
bg: Публикувани

source: Abstract
bg: Обобщение

source: Import
bg: Импортиране

source: Description
bg: описание

source: Title/Year
bg: Заглавие / Година

source: Import from Database
bg: Импортиране от база данни

source: Import from database
bg: Импортиране от база данни

source: Search citation databases
bg: Търсене в бази данни с цитати

source: Select at least one search engine.
bg: Изберете поне една търсачка.
