Repository: pypi-data/pypi-mirror-85
Catalog: packages/totalopenstation/totalopenstation-0.5.2.tar.gz/totalopenstation-0.5.2/locale/*/LC_MESSAGES/messages.po
Languages: de, el, fa, hu, it, nb_no, pl, pt_pt

source: Error loading the required model module: %s
de: Fehler beim Laden des benötigten Model-Moduls: %s
hu: Hiba a szükséges modul betöltése közben: %s
it: Errore: impossibile caricare il modulo Python richiesto per il modello: %s
nb_no: Feil ved innlasting av påkrevd modellmodul: %s
pt_pt: Erro ao carregar o módulo necessário: %s

source: usage: %prog [option] arg1 [option] arg2 ...
de: Nutzung: %prog [Option] arg1 [Option] arg2 ...
el: Χρήση: %prog [επιλογή] arg1 [επιλογή] arg2 ...
fa: استفاده : %prog [option] arg1 [option] arg2 ...
hu: használat: %prog [opció] arg1 [opció] arg2 ...
it: utilizzo: %prog [opzione] arg1 [opzione] arg2 ...
nb_no: bruk: %prog [valg] arg1 [valg] arg2 ...
pl: stosowanie: %prog [option] arg1 [option] arg2 ...
pt_pt: utilização: %prog [option] arg1 [option] arg2 ...

source: select input FILE (do not specify for stdin)
de: Eingabedatei auswählen (nicht für stdin angeben)
el: επιλέξτε το αρχείο εισόδου (δεν προσδιορίζει για stdin)
fa: فایل ورودی را مشخص کنید (برای stin مشخص نکنید)
hu: válassz bemenő FÁJLT (stdin használatához ne add meg)
it: indicare il FILE da leggere (non indicare per leggere dallo standard input)
nb_no: velg inndata- FILE (ikke angi for stdin)
pl: wybierz plik wejściowy (nie określaj dla stdin)
pt_pt: selecione FICHEIRO de entrada (não utilize para stdin)

source: select output FILE (do not specify for stdout)
de: Ausgabedatei auswählen (nicht für stdout angeben)
el: επιλέξτε το αρχείο εξόδου (δεν προσδιορίζει για stdout)
fa: فایل خروجی را مشخص کنید (برای stdout مشخص نکنید)
hu: válassz kimeneti FÁJLT (stdout használatához ne add meg)
it: indicare il FILE su cui salvare (non indicare per inviare allo standard output)
nb_no: velg utdata- FILE (ikke angi for stdout)
pl: wybierz plik wyjściowy(nie określaj dla stdout)
pt_pt: selecione FICHEIRO de saída (não utilize stdout)

source: select input FORMAT
de: Eingabeformat auswählen
el: Επιλέξτε τη μορφή εισόδου
fa: انتخاب فرمت ورودی
hu: válaszd ki az input FORMÁTUMOT
it: indicare il FORMATO del file da aprire
nb_no: Velg inndata- FORMAT
pl: wybierz format wejściowy
pt_pt: selecione o FORMATO de entrada

source: overwrite existing output file
de: Überschreibe vorhandene Ausgabedatei
el: αντικατάσταση υπάρχοντος αρχείου
fa: بازنویسی روي فایل خروجی موجود
hu: létező kimeneti fájl felülírása
it: sovrascrivere il file di salvataggio
nb_no: overskrift eksisterende utdatafil
pl: nadpisz plik wyjściowy
pt_pt: a gravar por cima do ficheiro de saída existente

source: list the available input and output formats
de: Auflisten der verfügbaren Eingabe- und Ausgabeformate
hu: listázza az elérhető bemeneti és kimeneti formátumokat
it: elenca i formati supportati in lettura ed esportazione
nb_no: liste over tilgjengelige inndata- og utdata-formater
pt_pt: listar formatos de entrada e saída disponíveis

source: Error: %(message)s %(formats)s
de: Fehler: %(message)s %(formats)s
hu: Hiba: %(message)s %(formats)s
it: Errore: %(message)s %(formats)s
nb_no: Feil: %(message)s %(formats)s
pt_pt: Erro: %(message)s %(formats)s

source: %s is not a valid input format
de: %s ist kein gültiges Eingabeformat
hu: %s nem érvényes bemeneti formátum
it: %s non è un formato valido in lettura
nb_no: %s er ikke et gyldig inndataformat
pt_pt: %s não é um formato de entrada válido

source: Please specify an input format
de: Bitte geben Sie ein Eingabeformat an
el: Παρακαλώ προσδιορίστε τον τύπο του αρχείου εισόδου
fa: لطفا یک فرمت ورودی را مشخص نماييد
hu: Kérlek adj meg egy bemeneti formátumot
it: Indicare un formato per il file da leggere
nb_no: Angi et inndataformat
pl: Wybierz format wejsciowy
pt_pt: Especifique um formato de entrada

source: No input data!
de: Keine Eingabedaten!
hu: Nincs bemenő adat!
it: Nessun dato da leggere!
nb_no: Ingen inndata.
pt_pt: Sem dados de entrada!

source: Downloaded data saved to out file %s
de: Heruntergeladene Daten aus Datei %s gespeichert
el: Τα ληφθέντα δεδομένα αποθηκεύτηκαν στο αρχείο %s,
fa: اطلاعات بارگیری شده در فایل خروجی %s ذخیره شد.
hu: Letöltött adatok %s fájlba mentve
it: I dati scaricati sono stati salvati nel file %s
nb_no: Nedlastet data lagret til utdatafil %s
pl: Dane zapisano do pliku %s
pt_pt: Dados descarregados gravados para o ficheiro de saída %s

source: Downloaded data saved to file %s,
de: Heruntergeladene Daten gespeichert in Datei %s,
el: Τα ληφθέντα δεδομένα αποθηκεύτηκαν στο αρχείο %s,
fa: اطلاعات دانلود شده به صورت فايل ذخيره شود %s,
hu: Letöltött adatok %s fájlba mentve,
it: I dati scaricati sono stati salvati nel file %s
nb_no: Nedlastet data lagret til filen %s,
pl: Dane zapisano do pliku %s
pt_pt: Dados descarregados gravados para o ficheiro %s,

source: overwriting the existing file
de: Überschreiben der vorhandenen Datei
el: Αντικατάσταση υπάρχοντος αρχείου
fa: بازنویسی روي فایل موجود
hu: létező fájl felülírása
it: sovrascrittura del file esistente
nb_no: overskriver eksisterende fil
pl: nadpisać istniejący plik
pt_pt: a gravar por cima do ficheiro existente

source: Specified output file already exists
de: Angegebene Ausgabedatei existiert bereits
el: Σφάλμα: Το αρχείο υπάρχει ήδη
fa: فایل خروجی مشخص شده وجود دارد.
hu: A megadott kimeneti fájl már létezik
it: Il file indicato esiste già
nb_no: Angitt utdatafil finnes allerede
pl: Plik o tej nazwie już istnieje
pt_pt: Já existe um ficheiro de saída com esse nome

source: Total Open Station is copyright 2008-2015 Luca Bianconi, Stefano Costa and the IOSA project, under the GNU GPL v3 or any later version. http://tops.iosa.it/ The application logo is copyright 2008 Lapo Calamandrei under the same license.
de: Total Open Station ist copyright 2008-2015 Luca Bianconi, Stefano Costa und IOSA project, unter der GNU GPL v3 oder jeglicher späteren Version. http://tops.iosa.it/ Das Logo der Anwendung ist copyright 2008 Lapo Calamandrei unter der selben Lizenz.
hu: A Total Open Station Luca Bianconi, Stefano Costa és az IOSA projekt GNU GPL v3 vagy bármelyik későbbi licenc alatti védjegye. 2008-2015 http://tops.iosa.it/ Az alkalmazás logó Lapo Calamandrei ugyanilyen licencű védjegye 2008.
it: Total Open Station © 2008-2015 Stefano Costa, Luca Bianconi e il progetto IOSA, sotto la licenza GNU GPLv3 o versioni successive. http://tops.iosa.it/ Logo di Total Open Station © 2008 Lapo Calamandrei sotto la stessa licenza.
nb_no: Total Open Station kopirett © 2008-2015 Luca Bianconi, Stefano Costa og IOSA-prosjektet, under GNU GPL v3 eller enhver senere versjon. http://tops.iosa.it/ Programmets logo, kopirett © 2008 Lapo Calamandrei under samme lisens.
pt_pt: O Total Open Station tem Direitos de Autor 2008-2018 Luca Bianconi, Stefano Costa e o projeto IOSA, sob a licença GNU GPL v3 ou qualquer versão posterior. http://tops.iosa.it/ O logótipo da aplicação tem Direitos de Autor 2008 Lapo Calamandrei sob a mesma licença.

source: Press OK when you're ready to download. Depending on your device, you may need to start the transfer from the total station menu.
de: Drücken Sie OK um das Herunterladen zu starten. Abhängig von Ihrem Gerät, müssen Sie eventuell den Transfer vom Menü Ihrer Totalstation starten.
hu: Nyomj OK-t, ha készen állsz a letöltésre. Eszköztől függően szükség lehet az adatátvitel indítására a mérőállomás menüjéből.
it: Premi OK quando sei pronto per scaricare. In base al tuo modello di stazione totale, potresti dover avviare il trasferimento dei dati dal menu dello strumento.
nb_no: Trykk OK når du er klart til å laste ned. Avhengig av enheten din, kan det hende du trenger å starte overføringen fra totalstasjonsmenyen.
pt_pt: Clique em OK quando estiver pronto para descarregar. Dependendo do dispositivo, talvez tenha de iniciar a transferência através do menu total station.

source: waiting for data from device
de: Warten auf Daten vom Gerät
el: αναμονή δεδομένων...
fa: انتظار برای اطلاعات از دستگاه
hu: várakozás az eszköz adataira
it: in attesa dei dati dallo strumento
nb_no: venter på data fra enhet
pl: czekam na dane z urządzenia
pt_pt: a aguardar pelos dados do dispositivo

source: Connection initialized with the following parameters:
de: Verbindung mit den folgenden Parametern initialisiert:
el: Η σύνδεση γίνεται με τις ακόλουθες παραμέτρους:
fa: اتصال با مقدار اولیه با پیروی از پارامترها:
hu: Kapcsolat létrehozva a következő paraméterekkel:
it: La connessione è stata avviata con i seguenti parametri:
nb_no: Tilkobling igangsatt med følgende parameter:
pl: Połączenie z instrumentem zainicjowano z następującymi parametrami:
pt_pt: Conexão inicializada com os seguintes parâmetros:

source: Start the download procedure on the device.
de: Beginn des Download-Vorgangs auf dem Gerät.
el: Ξεκινήστε από το όργανο τη διαδικασία αποστολής αρχείου.
fa: روند بارگیری بر روی دستگاه شروع شده است.
hu: Letöltési folyamat indítása az eszközön.
it: Avviare la procedura di download sullo strumento.
nb_no: Start nedlastingsprosedyren fra enheten.
pl: Uruchom transmisję w urządzeniu.
pt_pt: Iniciar procedimento de descarregamento no dispositivo.

source: Press OK when done.
de: Drücken Sie OK, wenn Sie fertig sind.
el: Πατήστε ΟΚ όταν ολοκληρωθεί η διαδικασία.
fa: هنگامي که انجام شد دکمه OK را بزنيد.
hu: Nyomj OK-t ha befejeződött.
it: Premere OK quando la procedura è completata.
nb_no: Trykk OK når du er ferdig.
pl: Naciśnij OK gdy gotowe.
pt_pt: Pressione OK quando terminar.

source: Choose output format and destination file
de: Wählen Sie das Ausgabeformat und die Zieldatei
el: Επιλέξτε τύπο αρχείου και αρχείο προορισμού
fa: انتخاب فرمت خورجی و مقصد فایل
hu: Válaszd ki a cél fájlt és a kimeneti formátumot
it: Selezionare un formato di esportazione e un file dove salvare
nb_no: Velg utdataformat og målfil
pl: Wybierz format oraz plik docelowy
pt_pt: Escolha o formato de saída e ficheiro de destino

source: Output format:
de: Ausgabeformat:⏎
el: Μορφή εξαγωγής:
fa: فرمت خروجی:
hu: Kimeneti formátum:
it: Formato di esportazione:
nb_no: Utdataformat:
pl: Format wyjściowy:
pt_pt: Formato de saída:

source: Input format
de: Eingabeformat
el: Μορφη εισαγωγης
fa: فرمت ورودی
hu: Bemeneti formátum
it: Formato dei dati da leggere
nb_no: Inndataformat
pl: Format wejściowy
pt_pt: Formato de entrada

source: choose a format
de: Wählen Sie ein Format
hu: válassz formátumot
it: scegliere un formato
nb_no: velg et format
pt_pt: escolha um formato

source: Output format
de: Ausgabeformat
hu: Kimeneti formátum
it: Formato di esportazione
nb_no: Utdataformat
pt_pt: Formato de saída

source: Import error
de: Importfehler
hu: Importálási hiba
nb_no: Importeringsfeil
pt_pt: Erro ao importar

source: Error loading the required input module: %s
de: Fehler beim Laden des benötigten Eingabemoduls; %s
hu: Hiba a szükséges bemeneti modul betöltése közben: %s
it: Errore nel caricamento del modulo Python richiesto per la lettura: %s
nb_no: Feil ved innlasting av påkrevd inndatamodul: %s
pt_pt: Falha ao carregar o módulo de entrada necessário: %s

source: Error loading the required output module: %s
de: Fehler beim Laden des benötigten Ausgabemoduls: %s
hu: Hiba a szükséges kimeneti modul betöltése közben: %s
it: Errore nel caricamento del modulo Python richiesto per la scrittura: %s
nb_no: Feil ved innlasting av påkrevd utdatamodul: %s
pt_pt: Falha ao carregar o módulo de saída necessário: %s

source: No output file specified
de: Keine Ausgabedatei angegeben
el: Δεν καθορίσθηκε αρχείο προορισμού
fa: هیچ فایل خروجی مشخص نشده
hu: Nincs megadva kimeneti fájl
it: Nessun file indicato per l'esportazione
nb_no: Ingen utdatafil valgt
pl: Nie wybrano pliku wyjściowego
pt_pt: Ficheiro de saída não especificado

source: No processing settings entered!
de: Keine Verarbeitung der eingegebenen Einstellungen!
el: Δεν δόθηκαν παράμετροι επεξεργασίας!
fa: تنظیمات پردازشی وارد نشده است!
hu: Nincsenek megadva feldolgozási beállítások!
it: Non sono stati indicati i parametri per l'esportazione!
nb_no: Ingen behandlingsinnstillinger oppgitt.
pl: Nie wybrano ustawień!
pt_pt: Nenhuma configuração de processamento inserida!

source: Error
de: Fehler
el: Σφάλμα
fa: خطا
hu: Hiba
it: Errore
nb_no: Feil
pl: Błąd
pt_pt: Erro

source: Connection failed with the following error message:
de: Die Verbindung wurde mit der folgenden Fehlermeldung unterbrochen::
el: Η επικοινωνία απέτυχε με το ακόλουθο μήνυμα σφάλματος:
fa: اتصال بدلیل مشکلات زیر برقرار نشد:
hu: Sikertelen kapcsolódás a következő hibaüzenettel:
it: La connessione è fallita con il seguente messaggio di errore:
nb_no: Tilkoblingen mislyktes med følgende feilmelding:
pl: Połączenie z urządzeniem nieudane. Komunikat błędu:
pt_pt: A conexão falhou com o código de erro:

source: Check your connection parameters and try again.
de: Überprüfen Sie Ihre Verbindungsparameter und versuchen Sie es erneut.
el: Ελέγξτε τις παραμέτρους επικοινωνίας και δοκιμάστε ξανά.
fa: پارامترهای اتصال را چک کنید و دوباره امتحان کنید.
hu: Ellenőrizd a kapcsolat paramétereit és próbáld újra.
it: Controllare i parametri di connessione e tentare nuovamente.
nb_no: Sjekk tilkoblingsparameterne og prøv igjen.
pl: Sprawdź parametry i spróbuj ponownie.
pt_pt: Verifique os parâmetros de conexão e tente novamente.

source: Cancel
de: Abbrechen
el: Ακύρωση
fa: لغو
hu: Mégsem
it: Annulla
nb_no: Avbryt
pl: Anuluj
pt_pt: Cancelar

source: Connect
de: Verbinden
el: Σύνδεση
fa: اتصال
hu: Kapcsolódás
it: Connessione
nb_no: Koble til
pl: Połącz
pt_pt: Conectar

source: Process data
de: Prozessdaten
el: Τα στοιχεία της διαδικασίας
fa: پردازش اطلاعات
hu: Adatfeldolgozás
it: Esporta dati
nb_no: Behandle data
pl: Przetwarzanie danych
pt_pt: Processar dados

source: Quit
de: Beenden
el: Έξοδος
fa: خارج شدن
hu: Kilépés
it: Esci
nb_no: Avslutt
pl: Zakończ
pt_pt: Sair

source: Open file
de: Datei öffnen
el: Άνοιγμα αρχείου
fa: باز کردن فایل
hu: Fájl megnyitás
it: Apri file ...
nb_no: Åpne fil
pl: Otwórz plik
pt_pt: Abrir ficheiro

source: Save raw data
de: Rohdaten speichern
el: Αποθήκευση ανεπεξέργαστων δεδομένων
fa: ذخیره داده های خام
hu: Nyers adatok mentése
it: Salva dati grezzi
nb_no: Lagre rådata
pl: Zapisz surowe dane
pt_pt: Gravar dados em bruto

source: About TOPS
de: Über TOPS
el: Σχετικά με το TOPS
fa: درباره TOPS
hu: A TOPS névjegye
it: Informazioni su TOPS
nb_no: Om TOPS
pl: O TOPS
pt_pt: Sobre o TOPS

source: Total Station
el: Γεωδαιτικός Σταθμός
fa: توتال استيشن
hu: Mérőállomás
it: Stazione totale
nb_no: Totalstasjon/elektronisk takymeter

source: choose a value
de: wählen Sie einen Wert
el: επιλογή τιμής
fa: انتخاب يک مقدار
hu: válassz egy értéket
it: selezionare un valore
nb_no: Velg en verdi
pl: wybierz wartość
pt_pt: escolha um valor

source: Bytesize
fa: اندازه‌ی بایت
hu: Byte méret
nb_no: Bytestørrelse

source: Parity setting
de: Parity Einstellung
el: Ρύθμιση ισοτιμιας
fa: تنظیمات توازن
hu: Paritás
it: Parità
nb_no: Paritetsinnstilling
pl: Parzystość
pt_pt: Configurações de paridade

source: Stop bit
de: Stopp-Bit
fa: ذره‌ی ایست نما
nb_no: Stoppbit
pt_pt: Bit de paragem

source: Time lapse between data packets
de: Time lapse zwischen Datenpaketen
hu: Adatcsomagok közötti késleltetés
it: Tempo di attesa tra i pacchetti dati
nb_no: Tid mellom datapakker
pt_pt: Intervalo de tempo entre dados de pacotes

source: Welcome. Turn your device on.
de: Willkommen. Schalten Sie Ihr Gerät ein.
el: Καλωσήρθατε. Ανοίξτε το Γεωδαιτικό σταθμό.
fa: خوش آمدید.⏎ دستگاه را روشن کنید.
hu: Üdvözlet. Kapcsold be az eszközt.
it: Benvenuti. Accendere lo strumento.
nb_no: Velkomen. Skru enheten din på.
pl: Witaj. Włącz urządzenie.
pt_pt: Bem-vindo(a). Ligue o seu dispositivo.

source: Waiting for data: please start transfer from your total station menu.
de: Warten auf Daten: Bitte starten Sie den Transfer über das Menü der Totalstation.
hu: Várakozás az adatokra: kérlek indítsd el az átvitelt a mérőállomás menüjéből.
it: In attesa dei dati: avvia il trasferimento dal menu della tua stazione totale.
nb_no: Venter på data: Start overføringen fra din totalstasjons meny.
pt_pt: A aguardar pelos dados: por favor inicie a transferência pelo menu total station.

source: Downloaded %d bytes
de: %d Bytes heruntergeladen
hu: %d byte letöltve
it: Ho scaricato %d byte
nb_no: Lastet ned %d byte
pt_pt: %d bytes descarregados

source: Success!
de: Erfolg!
hu: Siker!
it: Successo!
nb_no: Vellykket!
pt_pt: Concluído!

source: Download finished! You have %d bytes of data.
de: Herunterladen fertiggestellt! Es wurden %d Bytes Daten heruntergeladen.
hu: A letöltés befejeződött! %d byte adat letöltve.
it: Scaricamento completato! Hai %d byte di dati.
nb_no: Nedlasting fullført! Du har %d byte med data.
pt_pt: Descarregamento terminado! Tem %d bytes de dados.

source: Port
el: Θύρα
fa: درگاه
it: Porta seriale
pt_pt: Porta
